#!/bin/sh

# Перевіряємо, чи задано ім'я директорії
if [ -z "$1" ]; then
    echo "Ви не вказали ім'я директорії"
    exit 1
fi

# Отримуємо ім'я директорії
target_dir="$1"

# Перевіряємо, чи вже існує директорія
if [ -d "$target_dir" ]; then
    echo "Помилка: Директорію '$target_dir' не вдалося створити, оскільки вона вже існує."
    exit 1
fi

# Створюємо нову директорію
mkdir "$target_dir"
if [ $? -ne 0 ]; then
    echo "Помилка: Не вдалося створити директорію '$target_dir'."
    exit 1
fi

# Проходимо по всіх файлах у поточній директорії
for file in *; do
    # Перевіряємо, чи це файл, а не директорія
    if [ -f "$file" ]; then
        # Створюємо символьне посилання у новій директорії
        ln -s "$(pwd)/$file" "$target_dir/$file"
        if [ $? -ne 0 ]; then
            echo "Помилка: Не вдалося створити символьне посилання для '$file'."
        fi
    fi
done

echo "Символьні посилання створені у директорії '$target_dir'."
